# ===========================================================================
# Brewfile — Mac novo (epoch-chrono/dotfiles)
# ===========================================================================
# Aplicado via: brew bundle --no-upgrade --file=Brewfile
# Documentação: https://docs.brew.sh/Brew-Bundle-and-Brewfile
#
# Estratégia de fontes (decisão por categoria, não absoluta):
#
#   1. mise para versionar:
#      - Linguagens versionadas (Python, Node, Go, Ruby) — mise pré-reqs
#      - CLIs versionáveis com binários em GitHub Releases padrão
#        (k9s, popeye, btop, fastfetch, tmux, postgresql, etc)
#      - Backends preferidos: aqua > github > asdf
#
#   2. brew para:
#      - Linguagens base que também são pre-reqs de muitas formulas
#        (Python, Elixir, Rust) — coexistem com mise; mise vence no PATH
#      - Deps universais (make, imagemagick) que muitas formulas brew
#        precisam — manter brew evita duplicação e conflito de paths
#      - Provisioning managers (mise, chezmoi, mas) — release estável,
#        sem urgência de bleeding-edge, lifecycle unificado via brew
#      - Replacements de utilities sistêmicas (GNU sed/grep/tar/etc)
#      - Apps GUI (casks — futuro)
#      - Apps Mac App Store (via mas — futuro, requer `mas list` do
#        Mac antigo pra IDs)
#      - Tools onde mise quebra (granted hospedado em releases.commonfate.io,
#        sshpass binary C abandonado, etc)
#
#   3. Critério prático para "fica em ambos":
#      Se uma linguagem é pre-req de várias formulas brew E é versionada,
#      faz sentido coexistir. Mise vence no PATH; brew fica como "system
#      runtime" pra deps. Validado para python; mesmo padrão para elixir
#      e rust.
#
# Built-ins do brew (NÃO precisam tap explícito):
#   - homebrew/core e homebrew/cask: built-in desde sempre
#   - homebrew/bundle e homebrew/services: built-in desde brew 4.5.0
# ===========================================================================


# ── Taps externos ─────────────────────────────────────────────────────────
# Cada tap aqui foi avaliado contra a regra mise-first e ficou no brew
# por razões específicas. brew bundle auto-tapa, mas declaramos
# explicitamente para documentação.

# sshpass binary. Não em homebrew/core por questões de segurança
# (passa senha em CLI). Tap mantido por hudochenkov; sem commits há 10
# anos mas o binary é C clássico, raramente muda. Sem alternativa mise.
tap "hudochenkov/sshpass"

# Granted — AWS access tooling. VOLTOU pro Brewfile depois de testar
# `mise install granted`: o backend aqua (fwdcloudsec/granted no aqua
# registry) só publica binários pra linux/windows, sem darwin/arm64.
# Erro observado: `aqua:fwdcloudsec/granted@latest: unsupported env:
# darwin/arm64 (supported: ["linux", "windows"])`. O tap oficial do
# Common Fate (fwdcloudsec/granted) tem release pra macOS ARM64, então
# é a única forma viável atualmente. Em config.toml.tmpl, granted está
# comentado pra evitar conflito.
tap "fwdcloudsec/granted"

# Cloudquery — cloud asset discovery / inventory.
tap "cloudquery/tap"

# Turbot Powerpipe — dashboards de segurança/compliance.
tap "turbot/tap"

# Tap rbenv/tap — fornece versões legadas de OpenSSL que brew core removeu.
# Usado especificamente pra openssl@1.1 (EOL set/2023) que ainda é necessária
# pra compilar Python 2.7, Ruby < 3.1, e outras tools antigas que não
# suportam OpenSSL 3.x. Fórmula instalada via brew: rbenv/tap/openssl@1.1
# (versão 1.1.1w-1, suporta darwin/arm64).
tap "rbenv/tap"

# Mole — CLI pra criar túneis SSH com resiliência (reconnect, aliases,
# multiple tunnels via mesma conexão). Tap mantido por davrodpin, projeto
# ativo. Sem alternativa via mise (não tem entry no registry), então fica
# em brew. Repo: github.com/davrodpin/mole
tap "davrodpin/mole"


# ── Gerenciadores de versão e dotfiles ────────────────────────────────────
# Ferramentas que orquestram outras ferramentas. Ficam no brew (não no
# mise auto-referencial) por simplicidade e lifecycle unificado:
#   - Atualização: `brew upgrade <tool>` ou via Brewfile re-run.
#   - Reprodutibilidade: parte do mesmo manifesto declarativo.
#   - Tradeoff aceito: brew tende a ficar 1 minor atrás do upstream; pra
#     ferramentas estáveis dessa categoria, irrelevante.

# mise — runtime/tool version manager. Substitui asdf/nvm/pyenv/rbenv.
# Path precisa vir antes do brew shellenv para "vencer" no resolve.
brew "mise"

# chezmoi — dotfile manager declarativo. Substitui stow/yadm/GNU stow.
# Integração nativa com 1Password CLI, templates Go, run hooks, etc.
brew "chezmoi"

# mas — Mac App Store CLI. Permite gerenciar apps da Mac App Store via
# Brewfile (entrada `mas "AppName", id: 1234567890`). brew bundle dump
# captura apps instalados automaticamente, brew bundle aplica.
brew "mas"


# ── Brew pre-reqs: linguagens base ────────────────────────────────────────
# Coexistem com mise. Mise gerencia versionamento para uso diário; brew
# mantém versão "system" usada como dep por outras formulas. Mise deve
# vir antes no PATH (configurado via shellenv depois).

# Python: dep de muitas formulas + uso direto pra scripts.
# Versão fixada explicitamente pra estabilidade de virtualenvs.
brew "python@3.13"

# Elixir: pre-req potencial de outras formulas. Uso diário via mise.
brew "elixir"

# Rust: usado como dep por algumas formulas (compilação from-source).
# Uso diário (cargo, rustc) via mise.
brew "rust"


# ── Brew pre-reqs: build / image processing universal ─────────────────────
# Não são linguagens, mas são "deps universais" — muitas formulas
# dependem delas. Manter no brew evita duplicação e conflito de paths
# (mise não cobre bem deps nativas como libpng, libjpeg, etc).

# GNU Make. Base de qualquer build. /usr/bin/make do Xcode CLT existe
# mas é antigo. Brew make é mais novo e necessário para muitos Makefiles
# modernos que assumem GNU make >= 4.x.
brew "make"

# Autotools — gerador de scripts de configure (configure.ac → configure).
# Necessário pra tools que mise compila do source via autogen.sh (vimos
# erro: "./autogen.sh: line 18: aclocal: command not found"). aclocal vem
# de automake; m4 + autoconf são deps; libtool é comum em projetos que
# usam libraries compartilhadas.
brew "autoconf"
brew "automake"
brew "libtool"

# OpenSSL 1.1 — DEPRECATED, EOL desde set/2023. Brew core removeu a fórmula.
# Vem do tap rbenv/tap (mantido pra builds de Ruby/Python legados que não
# compilam contra OpenSSL 3.x).
#
# Uso aqui: pré-requisito pra Python 2.7.18 declarado no mise config
# (dot_config/mise/config.toml.tmpl) com env var:
#   PYTHON_BUILD_HOMEBREW_OPENSSL_FORMULA = "openssl@1.1"
#
# Mise/python-build lê essa env var e usa OpenSSL 1.1 ao compilar Python
# 2.7 do source. Sem isso, build falha em erros como:
#   ssl module compilation failed
#   Could not find OpenSSL library
#
# Python 2.7 está EOL desde 2020, mas legacy projects (scripts antigos,
# tools que não migraram pra py3) ainda precisam. Quando não precisar
# mais, remover este brew + remover Python 2.7 do mise config + remover
# tap rbenv/tap acima.
brew "rbenv/tap/openssl@1.1"

# ImageMagick. Conjunto enorme de deps nativas (libpng, libjpeg, libtiff,
# libwebp, libheic, libavif, ghostscript, etc). Brew gerencia tudo
# automaticamente. Uso pessoal é casual (convert, resize) mas várias
# formulas brew têm imagemagick como dep — manter aqui evita conflito.
brew "imagemagick"


# ── System replacements: GNU / newer-than-system ──────────────────────────
# Substituem (ou complementam) versões antigas/BSD do sistema base macOS.
# Necessário pra compatibilidade com scripts shell que assumem comportamento
# GNU, ou pra ter versões mais recentes/seguras.

brew "binutils"           # GNU binutils (ld, as, ar, etc — não no /usr/bin)
brew "diffutils"          # GNU diff (mais flexível que BSD diff)
brew "file-formula"       # GNU file (newer than /usr/bin/file)
brew "coreutils"          # GNU coreutils (ls, cp, mv, rm, etc. com prefixo "g" — gls, gcp, ...)
brew "findutils"          # GNU find/locate/xargs (gfind, glocate, gxargs)
brew "gawk"               # GNU awk (vs BSD awk do sistema)
brew "git"                # newer than /usr/bin/git do Xcode CLT
brew "gnu-indent"         # GNU indent (formatador C)
brew "gnu-sed"            # GNU sed (vs BSD sed — diferenças em -i, regex)
brew "gnu-tar"            # GNU tar (vs BSD tar)
brew "gnu-which"          # GNU which
brew "gnupg"              # GPG (não vem no macOS)
brew "gpatch"             # GNU patch
brew "grep"               # GNU grep (suporta PCRE etc — vs BSD grep)
brew "gzip"               # GNU gzip
brew "less"               # newer than /usr/bin/less
brew "openssh"            # newer ssh client/server (vs Apple's)
brew "rsync"              # newer rsync (macOS tem rsync 2.6 ancient)
brew "wget"               # não vem no macOS

# Bash completions. Usado mesmo com fish como shell padrão: completions
# de tools "bash-only" são portadas para fish via script auxiliar.
brew "bash-completion@2"


# ── Shells alternativos ───────────────────────────────────────────────────
# Mesmo o shell padrão sendo fish, manter os outros pra experimentos
# eventuais e por consistência (zsh é o default macOS, válido ter newer).

brew "fish"               # shell preferido (preferência registrada)
brew "fish-lsp"           # LSP para fish (helix integration)
brew "zsh"                # default macOS, versão mais nova
brew "zsh-completions"    # completions adicionais zsh
brew "nushell"            # experimento futuro
brew "elvish"             # experimento futuro


# ── Mac-specific utilities ────────────────────────────────────────────────

brew "duti"               # default URI handlers (associações de tipo)
brew "defaultbrowser"     # set default browser via CLI (usado pelo role macos-defaults)
brew "maclaunch"          # gerenciar launch agents/daemons
brew "pinentry-mac"       # GPG pinentry para macOS
brew "displayplacer"      # CLI pra gerenciar layout/resolução de monitores
brew "dockutil"           # CLI pra add/remove/move items do Dock macOS


# ── Network / security ────────────────────────────────────────────────────

brew "clamav"             # antivirus (scan ad-hoc)
brew "mole"               # CLI pra túneis SSH com resiliência (tap davrodpin/mole)
brew "mtr"                # traceroute + ping integrado
brew "nmap"               # network scanner
brew "p7zip"              # 7zip (compressão)
brew "socat"              # socket cat — debug de rede avançado
brew "tcpdump"            # captura de pacotes
brew "tcpflow"            # reconstrução de fluxo TCP
brew "tailscale"          # mesh VPN WireGuard — formula CLI; cask "tailscale-app" falha em
                          # macOS Tahoe (issue tailscale/tailscale#17891 — PKG installer +
                          # System Extension órfã). Daemon roda via:
                          #   sudo brew services start tailscale
                          #   sudo tailscale up
                          # Sem GUI/menu bar app — operação via CLI (status / login / etc.)


# ── Container / cloud ─────────────────────────────────────────────────────

brew "podman-compose"     # docker-compose para podman
brew "mongodb-atlas-cli"  # MongoDB Atlas CLI
brew "kubescape"          # k8s security scanner (sem alternativa mise estável)
brew "prowler"            # cloud security scanner


# ── CLI utilities (modern + classic) ──────────────────────────────────────

brew "asciinema"          # gravar sessões terminal
brew "bfg"                # BFG repo cleaner (limpar git history)
brew "bitwarden-cli"      # cold storage de credenciais (1Password é primário)
brew "bore-cli"           # tunneling reverso TCP
brew "cpulimit"           # limitar CPU por processo
brew "dateutils"          # utilities para manipular datas em CLI
brew "detox"              # sanitize filenames
brew "dos2unix"           # converter line endings
brew "exercism"           # plataforma de prática de coding
brew "graphviz"           # renderização de grafos (dot, fdp, etc)
brew "gtop"               # system monitor TUI
brew "himalaya"           # email TUI client
brew "magic-wormhole"     # transferência de arquivos peer-to-peer
brew "ponysay"            # fortune-cookie estilo, fun
brew "summarize"          # text summarization (https://summarize.sh)
brew "sysbench"           # benchmark sistema
brew "the_silver_searcher" # ag — grep recursivo rápido (asdf plugin é problemático)
brew "timewarrior"        # time tracking CLI
brew "tree"               # tree view de diretórios
brew "watch"              # rodar comando periodicamente


# ── DB clients CLI (client-only, sem servidor) ────────────────────────────
# Alternativa intencional pro mise install mysql/postgres, que instalariam
# o pacote completo (server + client). Aqui pegamos só os binários cliente
# (psql, mysql, mysqldump, pg_dump, pg_restore, mongo, etc.) sem daemons
# nem dependências de runtime de servidor — ~50 MB total vs centenas pelo
# mise full install.

brew "mysql-client"       # cliente MySQL (mysql, mysqldump, mysqladmin)
brew "libpq"              # cliente PostgreSQL (psql, pg_dump, pg_restore)


# ── Formulas dos taps externos ────────────────────────────────────────────
# Cada uma vinculada a um tap declarado acima.

# Não há alternativa via mise; binário antigo mas estável.
brew "sshpass"

# Granted — voltou pro brew porque aqua/mise não suporta darwin/arm64.
# Ver comentário do tap fwdcloudsec/granted acima pra contexto completo.
# gdeploy fica de fora por padrão — adicionar se ainda usado:
# brew "fwdcloudsec/granted/gdeploy"
brew "fwdcloudsec/granted/granted"

# Cloudquery CLI.
brew "cloudquery/tap/cloudquery"

# Powerpipe CLI.
brew "turbot/tap/powerpipe"


# ===========================================================================
# CASKS — Apps GUI (gerenciados via /Applications)
# ===========================================================================
# brew cask instala apps em /Applications. Updates via `brew upgrade --cask`
# ou via Brewfile re-run (com --no-upgrade pra não trocar versão sem querer).


# ── Senha / credenciais ───────────────────────────────────────────────────
cask "1password"               # gerenciador principal de credenciais
cask "1password-cli"           # pre-req pra integração com outros apps (ssh agent, etc)
cask "bitwarden"               # cold storage pessoal + fonte de verdade da Apoia.se


# ── AI tooling ────────────────────────────────────────────────────────────
cask "claude"                  # Claude Desktop (Anthropic)
cask "claude-code"             # Claude Code CLI distribuído via cask
cask "claudebar"               # menubar pra monitoramento de tokens/usage (Claude, Antigravity, Gemini)


# ── Browsers / VPN / network ──────────────────────────────────────────────
cask "google-chrome"           # browser

# Tunnelblick (OpenVPN client) + tunnelblickctl (CLI control) — gerencia
# .ovpn files (Apoia.se infra + NordVPN servers via .ovpn export).
tap "benwebber/tunnelblickctl"
brew "tunnelblickctl"
cask "tunnelblick@beta"        # beta — features novas do OpenVPN

cask "adguard"                 # content blocker
cask "rustdesk"                # remote desktop
cask "ngrok"                   # tunneling reverso HTTP/TCP
cask "royal-tsx"               # gerenciador de RDP/SSH/etc (substitui MS RD)


# ── Terminal / IDE ────────────────────────────────────────────────────────
cask "iterm2"                  # terminal emulator
cask "cursor"                  # IDE principal (registrado em userMemories)


# ── Comunicação ───────────────────────────────────────────────────────────
cask "slack"                   # work + comunidades
cask "discord"                 # comunidades
cask "telegram"                # mensageria
cask "whatsapp"                # mensageria


# ── Mac utilities ─────────────────────────────────────────────────────────
cask "bartender"               # menubar manager
cask "betterdisplay"           # resolution/display manager (replacement EasyRes)
cask "bettertouchtool"         # gestures + window mgmt
cask "caffeine"                # keep awake
cask "contexts"                # window switcher
cask "popclip"                 # selection actions
cask "raycast"                 # launcher
cask "keymapp"                 # ZSA keyboards config
cask "timemachineeditor"       # backup scheduling


# ── Screenshot ────────────────────────────────────────────────────────────
cask "shottr"                  # capture rápido
cask "snagit"                  # capture + anotação avançada (Techsmith)


# ── Disk / files / compression ────────────────────────────────────────────
cask "daisydisk"               # disk usage analyzer
# cask "maccleaner-pro"        # TEMPORARIAMENTE DESABILITADO (2026-05):
                               # checksum mismatch upstream.
                               # Cask espera SHA-256 49e1f9e1... mas servidor da
                               # Nektony serve e2509507... — publisher subiu nova
                               # versão sem atualizar homebrew-cask. Re-habilitar
                               # quando: brew install --cask maccleaner-pro
                               # rodar sem erro (testar caso a caso).
cask "forklift"                # file manager dual-pane
cask "keka"                    # compression
cask "kekaexternalhelper"      # companion do Keka
cask "macfuse"                 # pre-req: keybase + pCloud (a ser instalado fora)
cask "rar"                     # RAR proprietário
cask "qbittorrent"             # torrent


# ── Security (Objective-See / Patrick Wardle) ─────────────────────────────
cask "blockblock"              # monitor de persistence
cask "lulu"                    # firewall outbound
cask "knockknock"              # scan de persistence items
cask "taskexplorer"            # process inspector


# ── Productivity / docs ───────────────────────────────────────────────────
cask "typora"                  # markdown editor
cask "notion"                  # workspace / wiki
cask "wpsoffice"               # office suite alternativo


# ── DB clients ────────────────────────────────────────────────────────────
cask "medis"                   # Redis GUI
cask "mongodb-compass"         # MongoDB GUI oficial
cask "nosqlbooster-for-mongodb" # MongoDB GUI third-party (queries avançadas)


# ── AWS / cloud tools ─────────────────────────────────────────────────────
# AWS CLI core vem via mise (`awscli` no config.toml.tmpl). Plugins do AWS
# CLI (que são binários separados invocados pelo aws CLI) vêm via brew
# cask quando há cask oficial — manter package management unificado.
#
# session-manager-plugin: binário invocado por `aws ssm start-session` pra
# conectar em EC2 via SSM (Sebastião bastion, instâncias privadas, etc).
# Distribuído pela AWS como .pkg signed installer. Cask oficial do brew
# faz o install do .pkg em /usr/local/sessionmanagerplugin/ + symlink em
# /usr/local/bin/session-manager-plugin. Verificar com:
#   session-manager-plugin --version
#   aws ssm start-session --target i-XXXXX --profile YYY
cask "session-manager-plugin"  # plugin SSM Session Manager pro AWS CLI


# ── AI / coding agents ────────────────────────────────────────────────────
# Tools de coding agents centralizadas no brew (centralizamos aqui em vez
# de mise porque brew distribui binários signed/notarized direto da fonte,
# sem precisar passar pelo backend npm: do mise — menos camadas e melhor
# integração macOS/Tahoe). Updates via `brew upgrade --cask` (incluso na
# task `brew upgrade --cask --greedy` do playbook).
#
# Note: cada agent tem subscrição/auth própria. cursor-cli requer Cursor
# subscription; claude-code requer Anthropic account (Claude Pro/Max/
# Console/etc); gemini-cli usa Google account ou GEMINI_API_KEY.
# brew "gemini-cli"            # https://github.com/google-gemini/gemini-cli (formula)  # substituido por antigravity-cli
cask "antigravity"             # https://antigravity.google/product/antigravity-2
cask "antigravity-cli"         # https://antigravity.google/product/antigravity-cli
cask "antigravity-ide"         # https://antigravity.google/product/antigravity-ide
cask "claude-code"             # stable channel (~1 semana atrás, skip regressions majores)
cask "cursor-cli"              # command-line agent for Cursor

# Alternativas de channel pro claude-code (não usadas — comentadas pra ref):
# cask "claude-code@latest"    # latest channel (versão mais recente disponível)


# ── Containers / dev ──────────────────────────────────────────────────────
cask "podman-desktop"          # GUI pro podman
cask "gitkraken-cli"           # AI commit message generator


# ── System info / misc ────────────────────────────────────────────────────
cask "crystalfetch"            # macOS-specific system info
cask "keybase"                 # crypto + chat
cask "vlc"                     # media player
cask "utm"                     # VMs (QEMU frontend)


# ── Fontes ────────────────────────────────────────────────────────────────
# Tap experimental epoch-chrono/fonts hospeda Input Mono Nerd Font, que
# NÃO está disponível nos releases oficiais de Nerd Fonts (removida por
# questões de licença OFL — Reserved Font Name "Input"). Tap renomeia
# pra "InputMono Nerd Font" (compliance).
#
# Repo: github.com/epoch-chrono/homebrew-fonts
tap "epoch-chrono/fonts"

# Primária — Input Mono patcheada com Nerd Fonts 3.4.0 (11,313 codepoints).
# Variants: só Regular por enquanto. Bold/Italic dependem de patcheamento
# individual quando o user gerar.
cask "font-input-mono-nerd-font"

# Fallback / segunda opção — Fira Code NFP (cobertura completa, ligatures
# preservadas). Útil quando Input Mono não tem Bold/Italic ainda.
cask "font-fira-code-nerd-font"

# Vanilla Input Mono (sem Nerd glyphs) — não usado, comentado:
# cask "font-input"


# ===========================================================================
# MAS — Apps da Mac App Store
# ===========================================================================
# Apps MAS NÃO ficam aqui no Brewfile — gerenciados via task Ansible com
# o módulo `community.general.mas`. Razões:
#   1. `brew bundle` chama mas-cli em contexto SSH non-interactive durante
#      o bootstrap, e mas-cli falha intermitentemente nesse contexto.
#   2. O módulo Ansible suporta state: present/absent/latest, loop nativo
#      por lista de IDs, check_mode, become: true explícito pra uninstall.
#   3. Falhas individuais não derrubam o bootstrap inteiro (failed_when
#      permissivo na task).
#
# Lista declarada em: ansible/roles/homebrew/defaults/main.yml
# Task de install: ansible/roles/homebrew/tasks/packages.yml
